ExprovipFuel/src/Documents/ОплатаПоставщикам/ОплатаПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаПоставщикам</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоставщики</registerRecords>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВалютная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ExprovipFuel/src/AccumulationRegisters/ВзаиморасчетыПоставщики/ВзаиморасчетыПоставщики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыПоставщики</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВалютная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаТранзакции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ExprovipFuel/src/Documents/ОплатаПоставщикам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	ДвиженияВзаиморасчетыПоставщики();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияВзаиморасчетыПоставщики()
	Движения.ВзаиморасчетыПоставщики.Записывать = Истина;
	Для Каждого ТекСтрокаОплаты из Оплаты Цикл
		Движение = Движения.ВзаиморасчетыПоставщики.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Контрагент = ТекСтрокаОплаты.Контрагент;
		Движение.Валюта = ТекСтрокаОплаты.Валюта;
		Движение.Сумма = МодульЧисла(ТекСтрокаОплаты.Сумма);
		Движение.СуммаВалютная = МодульЧисла(ТекСтрокаОплаты.СуммаВалютная);
		Движение.ДатаТранзакции = Дата;
	КонецЦикла;
КонецПроцедуры

Функция МодульЧисла(ВходящееЧисло)
	Если ВходящееЧисло < 0 Тогда
		Возврат -ВходящееЧисло;
	Иначе
		Возврат ВходящееЧисло;
	КонецЕсли;		
КонецФункции

#КонецОбласти	

#КонецЕсли
